{"id":"c163","nl_problem":"Delilah writes down the positive factors of $12$ on a piece of paper, which she gives to Ezekiel. Next to each factor, Ezekiel writes all of the positive integers that are less than or equal to that number and that share no divisors with the factor other than $1.$ (So, for example, Ezekiel will write $``1\"$ next to each of the factors Delilah writes.) How many numbers total does Ezekiel write?"}
{"id":"c4376","nl_problem":"公司健身房只有一张乒乓球桌，小文、小斌、小超三位同事都想打球。他们商量好一个规则来进行“车轮战”：\n\n1.  两人上场比赛，一人在场下休息等待。\n2.  每局结束后，输的一方下场休息，换刚才休息的人上场，与上一局的胜者比赛。\n\n一个下午打下来，他们查看了运动手环的记录，发现：\n*   小文总共打了15局。\n*   小斌总共打了21局。\n*   小超总共休息了5局。\n*   所有人都记得，第一局比赛是在小斌和小超之间开始的。\n\n问题：请问，在他们打到第三局的时候，是谁在场下休息呢？"}
{"id":"c519","nl_problem":"Find all real values of $r$ that satisfy $\\frac1r > \\frac1{r-1} + \\frac1{r-4}.$ (Give your answer in interval notation.)"}
{"id":"c228","nl_problem":"Let $\\mathbf{a}$ and $\\mathbf{b}$ be vectors, and let $\\mathbf{m}$ be the midpoint of $\\mathbf{a}$ and $\\mathbf{b}.$  Given $\\mathbf{m} = \\begin{pmatrix} 3 \\\\ 7 \\end{pmatrix}$ and $\\mathbf{a} \\cdot \\mathbf{b} = 6,$ find $\\|\\mathbf{a}\\|^2 + \\|\\mathbf{b}\\|^2.$"}
{"id":"c695","nl_problem":"How many integers between 1000 and 2000 have all three of the numbers 15, 20 and 25 as factors?"}
{"id":"c778","nl_problem":"What is the smallest positive integer with exactly 10 positive integer divisors?"}
{"id":"c740","nl_problem":"A right circular cylinder with its diameter equal to its height is inscribed in a right circular cone. The cone has diameter 10 and altitude 12, and the axes of the cylinder and cone coincide. Find the radius of the cylinder. Express your answer as a common fraction."}
{"id":"c445","nl_problem":"What is the smallest positive integer with exactly 14 positive divisors?"}
{"id":"c322","nl_problem":"What is the area, in square units, of a regular hexagon inscribed in a circle whose area is $324\\pi$ square units? Express your answer in simplest radical form."}
{"id":"c4021","nl_problem":"Prove that the order of $\\mathrm{Aut}(\\mathbb{Z}_3\t\\times \\mathbb{Z}_9)$ is 108."}
